app/controllers/habits_controller.rb

  def index
    @habits = Habit.all
---
SELECT "habits".* FROM "habits"

  def auto_increment_value
  @habits = Habit.all

  @habits.each do |habit|
---
SELECT "habits".* FROM "habits"

  def create
    @habit = Habit.new(habit_params)
    @habit.current_value = @habit.goal_value
    if @habit.save
---
INSERT INTO "habits" ("user_id", "name", "goal_value", "unit", "actual_value", "carryover_value", "goal_type", "start_date", "end_date", "created_at", "updated_at", "period", "current_value", "last_increment_date") VALUES (NULL, '経済数学', 4.0, '時間', NULL, NULL, 'do', '2025-03-01', NULL, '2025-03-11 06:17:06.394064', '2025-03-11 06:17:06.394064', 1, 4.0, NULL) RETURNING "id"

def edit
  @habit = Habit.find(params[:id])
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" = 10 LIMIT 1

def update
  @habit = Habit.find(params[:id])
  if @habit.update(habit_params)
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" = 7 LIMIT 1
UPDATE "habits" SET "goal_value" = 1500.0, "actual_value" = 500.0, "updated_at" = '2025-03-01 11:31:35.662028' WHERE "habits"."id" = 7

  def record
    @habit = Habit.find(params[:id])
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" = 19 LIMIT 1

  def  update_record
    @habit = Habit.find(params[:id])
    actual_value = params[:habit][:actual_value].to_f
    new_goal_value = @habit.current_value - actual_value
    if @habit.update(current_value: new_goal_value, actual_value: actual_value)
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" = 10 LIMIT 1
UPDATE "habits" SET "actual_value" = 3.0, "updated_at" = '2025-04-14 00:45:08.015997', "current_value" = -8.0 WHERE "habits"."id" = 14

  def details
    @habit = Habit.find(params[:id])
---
SELECT "habits".* FROM "habits" WHERE "habits"."id" IN (41, 43, 44, 45)

  def destroy_multiple
    puts "Received habit ids: #{params[:habit_ids].inspect}"
    if params[:habit_ids].present?
    Habit.where(id: params[:habit_ids]).destroy_all
---
DELETE FROM "habits" WHERE "habits"."id" = 2
SELECT "habits".* FROM "habits" WHERE "habits"."id" IN (10, 15, 7, 16, 17, 14, 2, 9)