app/models/habit.rb

  def record_progress
    record = progress_records.find_or_initialize_by(date: Date.today)
    record.value = current_value
    record.save
---
UPDATE "actual_value_records" SET "value" = 3.0, "updated_at" = '2025-04-16 05:49:39.870849' WHERE "actual_value_records"."id" = 1
UPDATE "habits" SET "updated_at" = '2025-03-11 06:17:29.217428', "current_value" = 62.0, "last_increment_date" = '2025-03-11' WHERE "habits"."id" = 39
UPDATE "progress_records" SET "value" = -29.0, "updated_at" = '2025-04-22 13:54:41.698205' WHERE "progress_records"."id" = 146

  def record_actual_value
    record = actual_value_records.create(date: Date.today, value: self.actual_value)
---
INSERT INTO "actual_value_records" ("habit_id", "date", "value", "created_at", "updated_at") VALUES (51, '2025-04-16', 5.0, '2025-04-16 05:25:31.800541', '2025-04-16 05:25:31.800541') RETURNING "id"