app/views/habits/details.html.erb

SELECT "habits".* FROM "habits"
---

<div id="habit-graph" data-progress = "<%= @progress_records.map { |r| {date: r.date.strftime('%Y/%m/%d'), value: r.value } }.to_json  %>">