app/views/habits/record.html.erb


  <% @habit.actual_value_records.order(date: :desc).each do |record| %>
---
SELECT "actual_value_records".* FROM "actual_value_records" WHERE "actual_value_records"."habit_id" = 51 ORDER BY "actual_value_records"."date" DESC